_content/articles/Install-Something.org
#+TITLE: Install Something
#+DATE: 2015-12-27
#+DESCRIPTION: 安装一些东西
#+KEYWORDS: emacs,orgmode,install
#+OPTIONS: H:4 num:t toc:t \n:nil @:t ::t |:t ^:nil f:t tex:nil email:t timestamp:t
#+LINK_HOME: https://creamidea.github.io
#+STARTUP: showall


* 前言
  这个是我的一个配置环境的wiki，主要记录我这些年安装的软件和配置的一些服务。
  主要是在Windows7上和Linux(现在主要是Ubuntu)上。
  详细记录一些配置过程和安装的软件。方便以后重新安装系统。

* Node
  #+BEGIN_EXAMPLE
  ~/.npm
  /usr/local/bin/node
  /usr/local/bin/npm
  /usr/local/lib/node_modules
  /usr/local/libexec/node_modules
  /usr/local/share/man/man1/node*
  /usr/local/lib/dtrace/node.d
  /usr/local/include/node_modules
  /var/db/receipts/org.nodejs.node.pkg.*

  .node_repl_history
  #+END_EXAMPLE

* Git

** git lfs error: failed to push some refs to
   #+BEGIN_SRC sh
  # you should be able to fix your pushes by removing the .git/hooks/pre-push file from your repository. This is where git is trying to run git lfs when you push.
  rm .git/hooks/pre-push
   #+END_SRC
   Reference: https://github.com/github/git-lfs/issues/333
* Emacs
** Refile
   #+BEGIN_SRC elisp
  ;; http://superuser.com/a/373976
  (setq org-refile-use-outline-path 'file)
  (setq org-refile-targets '((org-agenda-files :level . 1)))
   #+END_SRC

** 待阅读：
1. [[http://stackoverflow.com/questions/4352367/is-it-possible-to-start-emacs-using-a-remote-configuration-file][Is it possible to start emacs using a remote configuration file?]]
2. [[http://www.ibm.com/developerworks/cn/linux/l-cn-emacs-shell/][当 Shell 遇见 Emacs -- 大话 Emacs Shell Mode]]
3. [[http://lifegoo.pluskid.org/wiki/EmacsAsFileManger.html][Emacs -- 强大的文件管理器]]
4. [[http://cx4a.org/software/gccsense/manual.html#Installation][GCCSense User Manual]]
5. [[http://emacser.com/emacs-gccsense.htm][Emacs补全利器：auto-complete+gccsense]]
6. [[http://blog.csdn.net/astropeak/article/details/6666527][《Emacs——你不能不用的神级利器》——补全（下）]]

* System Images SHA
  链接 [[https://msdn.microsoft.com/zh-cn/subscriptions/securedownloads/hh442898#searchTerm=&ProductFamilyId=481&Languages=en&PageSize=10&PageIndex=0&FileId=0][microsoft-msdn]]

  文件名： cn_windows_8_enterprise_x64_dvd_917570.iso
  SHA1：1280BC3A38A7001FDE981FA2E465DEB341478667

  文件名： en_windows_8_x64_dvd_915440.iso
  语言： English
  SHA1：1CE53AD5F60419CF04A715CF3233F247E48BEEC4

  文件名： cn_windows_8.1_with_update_x64_dvd_4048046.iso
  SHA1：F44B2BBD1F6F243DAAE172FA8C1DB342CB98EDAA

* libuv

  依赖 *autoconf* *automake* *libtool*

** Error: glibtoolize cannot found.
   #+BEGIN_SRC sh
if [ "$LIBTOOLIZE" = "" ] && [ "`uname`" = "Darwin" ]; then
  LIBTOOLIZE=libtoolize # 这里的glibtoolize -> libtoolize
fi
   #+END_SRC

** Undefined symbols for architecture x86_64
   #+BEGIN_SRC sh
clang -Wall -I/usr/local/libuv/include -L/usr/local/libuv/lib -luv main.c
   #+END_SRC

* m4
  看完这个文档 [[http://mbreen.com/m4.html][m4-doc]] or [[http://www.gnu.org/software/m4/manual/m4.html][GNU M4 1.4.17 macro processor]] ，感觉m4就是lisp宏的一个翻版嘛~ (逃...

  也可以参考这个[[http://garfileo.is-programmer.com/2011/4/21/interesting-gnu-m4.26282.html][有趣的 M4]] 。

* Verify the Signature
  #+BEGIN_SRC sh
  gpg --verify xxx.tar.gz.sig xxx.tar.gz
  # get the key ID
  gpg --recv-keys [key ID]
  # add the key
  gpg --verify --verbose xxx.tar.gz.sig xxx.tar.gz
  #+END_SRC
  Reference: http://www.cnblogs.com/daemon369/p/3204020.html

