static/html/articles/Install-Something.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-10-09 Sun 22:56 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>Install Something</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Junjia Ni">
<meta  name="description" content="安装一些东西"
>
<meta  name="keywords" content="emacs,orgmode,install">
<link rel="stylesheet" type="text/css" href="/static/article.css">
</head>
<body>
<div id="content">
<h1 class="title">Install Something</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 前言</a></li>
<li><a href="#orgheadline2">2. Node</a></li>
<li><a href="#orgheadline4">3. Git</a>
<ul>
<li><a href="#orgheadline3">3.1. git lfs error: failed to push some refs to</a></li>
</ul>
</li>
<li><a href="#orgheadline7">4. Emacs</a>
<ul>
<li><a href="#orgheadline5">4.1. Refile</a></li>
<li><a href="#orgheadline6">4.2. 待阅读：</a></li>
</ul>
</li>
<li><a href="#orgheadline8">5. System Images SHA</a></li>
<li><a href="#orgheadline11">6. libuv</a>
<ul>
<li><a href="#orgheadline9">6.1. Error: glibtoolize cannot found.</a></li>
<li><a href="#orgheadline10">6.2. Undefined symbols for architecture x86_64</a></li>
</ul>
</li>
<li><a href="#orgheadline12">7. m4</a></li>
<li><a href="#orgheadline13">8. Verify the Signature</a></li>
<li><a href="#orgheadline14">9. Extract Files</a></li>
<li><a href="#orgheadline16">10. Install Protobuf</a>
<ul>
<li><a href="#orgheadline15">10.1. PKG_CONFIG_PATH unknow</a></li>
</ul>
</li>
<li><a href="#orgheadline19">11. Install GnuPG</a>
<ul>
<li><a href="#orgheadline17">11.1. error: intmax_t unknow when compile</a></li>
<li><a href="#orgheadline18">11.2. Install TeX on Mac</a></li>
</ul>
</li>
<li><a href="#orgheadline20">12. iTerm2 GBK编码</a></li>
<li><a href="#orgheadline42">13. Windows</a>
<ul>
<li><a href="#orgheadline21">13.1. Install Windows7 Ultimate</a></li>
<li><a href="#orgheadline25">13.2. Install Emacs and config her</a>
<ul>
<li><a href="#orgheadline22">13.2.1. Change the Home Directory:</a></li>
<li><a href="#orgheadline23">13.2.2. Swap the CapsLk &amp;&amp; Ctrl\_L</a></li>
<li><a href="#orgheadline24">13.2.3. Reference:</a></li>
</ul>
</li>
<li><a href="#orgheadline31">13.3. Install Jekyll</a>
<ul>
<li><a href="#orgheadline26">13.3.1. Download:</a></li>
<li><a href="#orgheadline27">13.3.2. Install:</a></li>
<li><a href="#orgheadline28">13.3.3. Run:</a></li>
<li><a href="#orgheadline29">13.3.4. Change:</a></li>
<li><a href="#orgheadline30">13.3.5. Q&amp;A:</a></li>
</ul>
</li>
<li><a href="#orgheadline32">13.4. Install Foobar and config her</a></li>
<li><a href="#orgheadline33">13.5. Install Win7Code</a></li>
<li><a href="#orgheadline34">13.6. Install mit-scheme and fix some issue</a></li>
<li><a href="#orgheadline35">13.7. Install Java Development</a></li>
<li><a href="#orgheadline41">13.8. Install Qt Development</a>
<ul>
<li><a href="#orgheadline36">13.8.1. Download:</a></li>
<li><a href="#orgheadline37">13.8.2. Install:</a></li>
<li><a href="#orgheadline38">13.8.3. Configure:</a></li>
<li><a href="#orgheadline39">13.8.4. Emacs:</a></li>
<li><a href="#orgheadline40">13.8.5. Q &amp;&amp; A:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline57">14. Linux</a>
<ul>
<li><a href="#orgheadline43">14.1. Install Emacs and config it</a></li>
<li><a href="#orgheadline44">14.2. Install Google Chrome</a></li>
<li><a href="#orgheadline45">14.3. Return to classic gnome for ubuntu12.04+</a></li>
<li><a href="#orgheadline46">14.4. Install Git (You can find the books. Just click here)</a></li>
<li><a href="#orgheadline47">14.5. Add the picture when ubuntu boot up</a></li>
<li><a href="#orgheadline48">14.6. Install Adobe Flash Player</a></li>
<li><a href="#orgheadline51">14.7. Install Lua and Luarocks</a>
<ul>
<li><a href="#orgheadline49">14.7.1. lua</a></li>
<li><a href="#orgheadline50">14.7.2. Luarocks</a></li>
</ul>
</li>
<li><a href="#orgheadline52">14.8. Install Java</a></li>
<li><a href="#orgheadline53">14.9. MySQL</a></li>
<li><a href="#orgheadline54">14.10. Change Some Key Shortcuts</a></li>
<li><a href="#orgheadline55">14.11. Make Ubuntu12.04 hibernation</a></li>
<li><a href="#orgheadline56">14.12. Install Ubuntu12.04 black screen</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
这个是我的一个配置环境的wiki，主要记录我这些年安装的软件和配置的一些服务。
主要是在Windows7上和Linux(现在主要是Ubuntu)上。
详细记录一些配置过程和安装的软件。方便以后重新安装系统。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Node</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
~/.npm
/usr/local/bin/node
/usr/local/bin/npm
/usr/local/lib/node_modules
/usr/local/libexec/node_modules
/usr/local/share/man/man1/node*
/usr/local/lib/dtrace/node.d
/usr/local/include/node_modules
/var/db/receipts/org.nodejs.node.pkg.*

.node_repl_history
</pre>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">3</span> Git</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">3.1</span> git lfs error: failed to push some refs to</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">you should be able to fix your pushes by removing the .git/hooks/pre-push file from your repository. This is where git is trying to run git lfs when you push.</span>
rm .git/hooks/pre-push
</pre>
</div>
<p>
Reference: <a href="https://github.com/github/git-lfs/issues/333">https://github.com/github/git-lfs/issues/333</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">4</span> Emacs</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">4.1</span> Refile</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #969896; font-style: italic;">;; </span><span style="color: #969896; font-style: italic;">http://superuser.com/a/373976</span>
<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">setq</span> org-refile-use-outline-path <span style="color: #b5bd68;">'</span><span style="color: #81a2be;">file</span><span style="color: #c5c8c6;">)</span>
<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">setq</span> org-refile-targets <span style="color: #b5bd68;">'</span><span style="color: #8abeb7;">(</span><span style="color: #f0c674;">(</span>org-agenda-files <span style="color: #b294bb;">:level</span> . 1<span style="color: #f0c674;">)</span><span style="color: #8abeb7;">)</span><span style="color: #c5c8c6;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">4.2</span> 待阅读：</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li><a href="http://stackoverflow.com/questions/4352367/is-it-possible-to-start-emacs-using-a-remote-configuration-file">Is it possible to start emacs using a remote configuration file?</a></li>
<li><a href="http://www.ibm.com/developerworks/cn/linux/l-cn-emacs-shell/">当 Shell 遇见 Emacs &#x2013; 大话 Emacs Shell Mode</a></li>
<li><a href="http://lifegoo.pluskid.org/wiki/EmacsAsFileManger.html">Emacs &#x2013; 强大的文件管理器</a></li>
<li><a href="http://cx4a.org/software/gccsense/manual.html#Installation">GCCSense User Manual</a></li>
<li><a href="http://emacser.com/emacs-gccsense.htm">Emacs补全利器：auto-complete+gccsense</a></li>
<li><a href="http://blog.csdn.net/astropeak/article/details/6666527">《Emacs——你不能不用的神级利器》——补全（下）</a></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">5</span> System Images SHA</h2>
<div class="outline-text-2" id="text-5">
<p>
链接 <a href="https://msdn.microsoft.com/zh-cn/subscriptions/securedownloads/hh442898#searchTerm=&amp;ProductFamilyId=481&amp;Languages=en&amp;PageSize=10&amp;PageIndex=0&amp;FileId=0">microsoft-msdn</a>
</p>

<p>
文件名： cn_windows_8_enterprise_x64_dvd_917570.iso
SHA1：1280BC3A38A7001FDE981FA2E465DEB341478667
</p>

<p>
文件名： en_windows_8_x64_dvd_915440.iso
语言： English
SHA1：1CE53AD5F60419CF04A715CF3233F247E48BEEC4
</p>

<p>
文件名： cn_windows_8.1_with_update_x64_dvd_4048046.iso
SHA1：F44B2BBD1F6F243DAAE172FA8C1DB342CB98EDAA
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">6</span> libuv</h2>
<div class="outline-text-2" id="text-6">
<p>
依赖 <b>autoconf</b> <b>automake</b> <b>libtool</b>
</p>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">6.1</span> Error: glibtoolize cannot found.</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b5bd68;">if</span> <span style="color: #c5c8c6;">[</span> <span style="color: #8abeb7;">"$LIBTOOLIZE"</span> = <span style="color: #8abeb7;">""</span> <span style="color: #c5c8c6;">]</span> &amp;&amp; <span style="color: #c5c8c6;">[</span> <span style="color: #8abeb7;">"`uname`"</span> = <span style="color: #8abeb7;">"Darwin"</span> <span style="color: #c5c8c6;">]</span>; <span style="color: #b5bd68;">then</span>
  <span style="color: #f0c674;">LIBTOOLIZE</span>=libtoolize <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#36825;&#37324;&#30340;glibtoolize -&gt; libtoolize</span>
<span style="color: #b5bd68;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">6.2</span> Undefined symbols for architecture x86_64</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-sh">clang -Wall -I/usr/local/libuv/include -L/usr/local/libuv/lib -luv main.c
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">7</span> m4</h2>
<div class="outline-text-2" id="text-7">
<p>
看完这个文档 <a href="http://mbreen.com/m4.html">m4-doc</a> or <a href="http://www.gnu.org/software/m4/manual/m4.html">GNU M4 1.4.17 macro processor</a> ，感觉m4就是lisp宏的一个翻版嘛~ (逃&#x2026;
</p>

<p>
也可以参考这个<a href="http://garfileo.is-programmer.com/2011/4/21/interesting-gnu-m4.26282.html">有趣的 M4</a> 。
</p>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">8</span> Verify the Signature</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-sh">gpg --verify xxx.tar.gz.sig xxx.tar.gz
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">get the key ID</span>
gpg --recv-keys <span style="color: #c5c8c6;">[</span>key ID<span style="color: #c5c8c6;">]</span>
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">add the key</span>
gpg --verify --verbose xxx.tar.gz.sig xxx.tar.gz
</pre>
</div>
<p>
Reference: <a href="http://www.cnblogs.com/daemon369/p/3204020.html">http://www.cnblogs.com/daemon369/p/3204020.html</a>
</p>
</div>
</div>
