_content/articles/Install-Something.org
* Extract Files
  #+BEGIN_SRC sh
  if [ -f $1 ] ; then
      case $1 in
          ,*.tar.bz2)      tar xvjf $1 && cd $(basename "$1" .tar.bz2) ;;
          ,*.tar.gz)       tar xvzf $1 && cd $(basename "$1" .tar.gz) ;;
          ,*.tar.xz)       tar Jxvf $1 && cd $(basename "$1" .tar.xz) ;;
          ,*.bz2)          bunzip2 $1 && cd $(basename "$1" /bz2) ;;
          ,*.rar)          unrar x $1 && cd $(basename "$1" .rar) ;;
          ,*.gz)           gunzip $1 && cd $(basename "$1" .gz) ;;
          ,*.tar)          tar xvf $1 && cd $(basename "$1" .tar) ;;
          ,*.tbz2)         tar xvjf $1 && cd $(basename "$1" .tbz2) ;;
          ,*.tgz)          tar xvzf $1 && cd $(basename "$1" .tgz) ;;
          ,*.zip)          unzip $1 && cd $(basename "$1" .zip) ;;
          ,*.Z)            uncompress $1 && cd $(basename "$1" .Z) ;;
          ,*.7z)           7z x $1 && cd $(basename "$1" .7z) ;;
          ,*)              echo "don't know how to extract '$1'..." ;;
      esac
  else
      echo "'$1' is not a valid file!"
  fi
  #+END_SRC

* Install Protobuf

** PKG_CONFIG_PATH unknow
   #+BEGIN_SRC sh
export LD_LIBRARY_PATH=$LD_LIBRARY_PATH:/usr/local/lib
export PKG_CONFIG_PATH=/usr/local/lib/pkgconfig
   #+END_SRC

* Install GnuPG
** error: intmax_t unknow when compile
   #+BEGIN_QUOTE
   After upgrading to Apple's Xcode 5.0, gnupg2 2.0.21 would no longer compile.

   For some reason or other, sm/stdint.h could not resolve certain typedefs.
   Workaround was to crassly force typedef resolution in sm/stdint.h with these
   lines after #include <stdint.h> :

   typedef long  			intptr_t;
   typedef long long               intmax_t;
   typedef unsigned long   	uintptr_t;
   typedef unsigned long long      uintmax_t;

   After that everything compiled and all make checks passed.
   #+END_QUOTE
   Reference: https://bugs.gnupg.org/gnupg/msg4744

** Install TeX on Mac
   #+BEGIN_SRC sh
$ sudo ln -s /Volumes/MyTeXLive/bin/universal-darwin /usr/texbin
   #+END_SRC

   或者 =TeX Live Utility > TeX programs (choose)= 这里修改TeX路径。

   使用清华TUNA: http://mirrors.tuna.tsinghua.edu.cn/CTAN/systems/texlive/tlnet

   Reference: https://www.tug.org/texlive/doc/texlive-en/texlive-en.html#tlportable

* iTerm2 GBK编码
  让iTerm2临时变成GBK编码的环境，首先创建一个名为GBK的Profile，然后将其字符编码改成GBK。运行下面的sh即可用。
  #+BEGIN_SRC sh
  #!/bin/bash
  # 使用GBK Profile
  echo -e "\033]50;SetProfile=GBK\a"
  # 环境编码切换为GBK
  export LANG=zh_CN.GBK
  export LC_ALL=zh_CN.GBK
  # 更改当前 iTerm2 tab title
  echo -ne "\033]0;"$@"\007"
  $@
  echo -ne "\033]0;"${PWD/#$HOME/~}"\007"
  # GBK任务完成后，自动切换回默认编码（UTF-8）
  echo -e "\033]50;SetProfile=Default\a"
  export LANG=zh_CN.UTF-8
  export LC_ALL=zh_CN.UTF-8
  #+END_SRC

* Windows
** Install Windows7 Ultimate
   1. From Home basic to Ultimate FOR LenoveY470:
      #+BEGIN_EXAMPLE
      6K2KY-BFH24-PJW6W-9GK29-TMPWP
      22TKD-F8XX6-YG69F-9M66D-PMJBM
      #+END_EXAMPLE
   2. Install Windows7 Ultimate by DVD/USB:

      waiting...
** Install Emacs and config her
*** Change the Home Directory:

    1. @@html:<kbd> Ctrl + R </kbd>@@
    2. Input "regedit"
    3. HKEY\_CURRENT\_USER/Software/GNU/Emacs/HOME=%The Home of Emacs%
       (New a string value)
*** Swap the CapsLk && Ctrl\_L
		1. Modify the regedit
		   #+BEGIN_EXAMPLE
		     REGEDIT4

                   [HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Keyboard Layout]
                   "Scancode Map"=hex:00,00,00,00,00,00,00,00,
                            03,00,00,00,1d,00,3a,00,
                            3a,00,1d,00,00,00,00,00
		     (New a binary Values)
		   #+END_EXAMPLE
		2. Download Software:
          + The script: http://www.cs.umb.edu/~wimiller/stuff/caps2ctrl.exe
          + The source: http://www.cs.umb.edu/~wimiller/stuff/caps2ctrl.ahk
		3. AutoHotKey:
		   #+BEGIN_EXAMPLE
			   Capslock::Ctrl
		   #+END_EXAMPLE
		4. *Reference:*
		     + http://www.emacswiki.org/emacs/MovingTheCtrlKey
*** Reference:
		+ http://www.emacswiki.org/emacs/JonathanArnoldDotEmacs
** Install Jekyll
