static/html/articles/Install-Something.html

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">9</span> Extract Files</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b5bd68;">if</span> <span style="color: #c5c8c6;">[</span> -f $<span style="color: #f0c674;">1</span> <span style="color: #c5c8c6;">]</span> ; <span style="color: #b5bd68;">then</span>
    <span style="color: #b5bd68;">case</span> $<span style="color: #f0c674;">1</span><span style="color: #b5bd68;"> in</span>
        *.tar.bz2)      tar xvjf $<span style="color: #f0c674;">1</span> &amp;&amp; <span style="color: #b294bb;">cd</span> $<span style="color: #c5c8c6;">(</span>basename <span style="color: #8abeb7;">"$1"</span> .tar.bz2<span style="color: #c5c8c6;">)</span> ;;
        *.tar.gz)       tar xvzf $<span style="color: #f0c674;">1</span> &amp;&amp; <span style="color: #b294bb;">cd</span> $<span style="color: #c5c8c6;">(</span>basename <span style="color: #8abeb7;">"$1"</span> .tar.gz<span style="color: #c5c8c6;">)</span> ;;
        *.tar.xz)       tar Jxvf $<span style="color: #f0c674;">1</span> &amp;&amp; <span style="color: #b294bb;">cd</span> $<span style="color: #c5c8c6;">(</span>basename <span style="color: #8abeb7;">"$1"</span> .tar.xz<span style="color: #c5c8c6;">)</span> ;;
        *.bz2)          bunzip2 $<span style="color: #f0c674;">1</span> &amp;&amp; <span style="color: #b294bb;">cd</span> $<span style="color: #c5c8c6;">(</span>basename <span style="color: #8abeb7;">"$1"</span> /bz2<span style="color: #c5c8c6;">)</span> ;;
        *.rar)          unrar x $<span style="color: #f0c674;">1</span> &amp;&amp; <span style="color: #b294bb;">cd</span> $<span style="color: #c5c8c6;">(</span>basename <span style="color: #8abeb7;">"$1"</span> .rar<span style="color: #c5c8c6;">)</span> ;;
        *.gz)           gunzip $<span style="color: #f0c674;">1</span> &amp;&amp; <span style="color: #b294bb;">cd</span> $<span style="color: #c5c8c6;">(</span>basename <span style="color: #8abeb7;">"$1"</span> .gz<span style="color: #c5c8c6;">)</span> ;;
        *.tar)          tar xvf $<span style="color: #f0c674;">1</span> &amp;&amp; <span style="color: #b294bb;">cd</span> $<span style="color: #c5c8c6;">(</span>basename <span style="color: #8abeb7;">"$1"</span> .tar<span style="color: #c5c8c6;">)</span> ;;
        *.tbz2)         tar xvjf $<span style="color: #f0c674;">1</span> &amp;&amp; <span style="color: #b294bb;">cd</span> $<span style="color: #c5c8c6;">(</span>basename <span style="color: #8abeb7;">"$1"</span> .tbz2<span style="color: #c5c8c6;">)</span> ;;
        *.tgz)          tar xvzf $<span style="color: #f0c674;">1</span> &amp;&amp; <span style="color: #b294bb;">cd</span> $<span style="color: #c5c8c6;">(</span>basename <span style="color: #8abeb7;">"$1"</span> .tgz<span style="color: #c5c8c6;">)</span> ;;
        *.zip)          unzip $<span style="color: #f0c674;">1</span> &amp;&amp; <span style="color: #b294bb;">cd</span> $<span style="color: #c5c8c6;">(</span>basename <span style="color: #8abeb7;">"$1"</span> .zip<span style="color: #c5c8c6;">)</span> ;;
        *.Z)            uncompress $<span style="color: #f0c674;">1</span> &amp;&amp; <span style="color: #b294bb;">cd</span> $<span style="color: #c5c8c6;">(</span>basename <span style="color: #8abeb7;">"$1"</span> .Z<span style="color: #c5c8c6;">)</span> ;;
        *.7z)           7z x $<span style="color: #f0c674;">1</span> &amp;&amp; <span style="color: #b294bb;">cd</span> $<span style="color: #c5c8c6;">(</span>basename <span style="color: #8abeb7;">"$1"</span> .7z<span style="color: #c5c8c6;">)</span> ;;
        *)              <span style="color: #b294bb;">echo</span> <span style="color: #8abeb7;">"don't know how to extract '$1'..."</span> ;;
    <span style="color: #b5bd68;">esac</span>
<span style="color: #b5bd68;">else</span>
    <span style="color: #b294bb;">echo</span> <span style="color: #8abeb7;">"'$1' is not a valid file!"</span>
<span style="color: #b5bd68;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">10</span> Install Protobuf</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">10.1</span> PKG_CONFIG_PATH unknow</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b294bb;">export</span> <span style="color: #f0c674;">LD_LIBRARY_PATH</span>=$<span style="color: #f0c674;">LD_LIBRARY_PATH</span>:/usr/local/lib
<span style="color: #b294bb;">export</span> <span style="color: #f0c674;">PKG_CONFIG_PATH</span>=/usr/local/lib/pkgconfig
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19"><span class="section-number-2">11</span> Install GnuPG</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">11.1</span> error: intmax_t unknow when compile</h3>
<div class="outline-text-3" id="text-11-1">
<blockquote>
<p>
After upgrading to Apple's Xcode 5.0, gnupg2 2.0.21 would no longer compile.
</p>

<p>
For some reason or other, sm/stdint.h could not resolve certain typedefs.
Workaround was to crassly force typedef resolution in sm/stdint.h with these
lines after #include &lt;stdint.h&gt; :
</p>

<p>
typedef long                          intptr_t;
typedef long long               intmax_t;
typedef unsigned long           uintptr_t;
typedef unsigned long long      uintmax_t;
</p>

<p>
After that everything compiled and all make checks passed.
</p>
</blockquote>
<p>
Reference: <a href="https://bugs.gnupg.org/gnupg/msg4744">https://bugs.gnupg.org/gnupg/msg4744</a>
</p>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">11.2</span> Install TeX on Mac</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">

<pre class="src src-sh">$ sudo ln -s /Volumes/MyTeXLive/bin/universal-darwin /usr/texbin
</pre>
</div>

<p>
或者 <code>TeX Live Utility &gt; TeX programs (choose)</code> 这里修改TeX路径。
</p>

<p>
使用清华TUNA: <a href="http://mirrors.tuna.tsinghua.edu.cn/CTAN/systems/texlive/tlnet">http://mirrors.tuna.tsinghua.edu.cn/CTAN/systems/texlive/tlnet</a>
</p>

<p>
Reference: <a href="https://www.tug.org/texlive/doc/texlive-en/texlive-en.html#tlportable">https://www.tug.org/texlive/doc/texlive-en/texlive-en.html#tlportable</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-2">
<h2 id="orgheadline20"><span class="section-number-2">12</span> iTerm2 GBK编码</h2>
<div class="outline-text-2" id="text-12">
<p>
让iTerm2临时变成GBK编码的环境，首先创建一个名为GBK的Profile，然后将其字符编码改成GBK。运行下面的sh即可用。
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #969896; font-style: italic;">#</span><span style="color: #969896; font-style: italic;">!/bin/</span><span style="color: #b5bd68;">bash</span>
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#20351;&#29992;GBK Profile</span>
<span style="color: #b294bb;">echo</span> -e <span style="color: #8abeb7;">"\033]50;SetProfile=GBK\a"</span>
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#29615;&#22659;&#32534;&#30721;&#20999;&#25442;&#20026;GBK</span>
<span style="color: #b294bb;">export</span> <span style="color: #f0c674;">LANG</span>=zh_CN.GBK
<span style="color: #b294bb;">export</span> <span style="color: #f0c674;">LC_ALL</span>=zh_CN.GBK
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">&#26356;&#25913;&#24403;&#21069; iTerm2 tab title</span>
<span style="color: #b294bb;">echo</span> -ne <span style="color: #8abeb7;">"\033]0;"</span>$<span style="color: #f0c674;">@</span><span style="color: #8abeb7;">"\007"</span>
$<span style="color: #f0c674;">@</span>
<span style="color: #b294bb;">echo</span> -ne <span style="color: #8abeb7;">"\033]0;"</span>$<span style="color: #c5c8c6;">{</span><span style="color: #f0c674;">PWD</span>/#$<span style="color: #f0c674;">HOME</span>/~<span style="color: #c5c8c6;">}</span><span style="color: #8abeb7;">"\007"</span>
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">GBK&#20219;&#21153;&#23436;&#25104;&#21518;&#65292;&#33258;&#21160;&#20999;&#25442;&#22238;&#40664;&#35748;&#32534;&#30721;&#65288;UTF-8&#65289;</span>
<span style="color: #b294bb;">echo</span> -e <span style="color: #8abeb7;">"\033]50;SetProfile=Default\a"</span>
<span style="color: #b294bb;">export</span> <span style="color: #f0c674;">LANG</span>=zh_CN.UTF-8
<span style="color: #b294bb;">export</span> <span style="color: #f0c674;">LC_ALL</span>=zh_CN.UTF-8
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline42" class="outline-2">
<h2 id="orgheadline42"><span class="section-number-2">13</span> Windows</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">13.1</span> Install Windows7 Ultimate</h3>
<div class="outline-text-3" id="text-13-1">
<ol class="org-ol">
<li><p>
From Home basic to Ultimate FOR LenoveY470:
</p>
<pre class="example">
6K2KY-BFH24-PJW6W-9GK29-TMPWP
22TKD-F8XX6-YG69F-9M66D-PMJBM
</pre></li>
<li><p>
Install Windows7 Ultimate by DVD/USB:
</p>

<p>
waiting&#x2026;
</p></li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">13.2</span> Install Emacs and config her</h3>
<div class="outline-text-3" id="text-13-2">
</div><div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">13.2.1</span> Change the Home Directory:</h4>
<div class="outline-text-4" id="text-13-2-1">
<ol class="org-ol">
<li>Ctrl + R</li>
</ol>
<ol class="org-ol">
<li>Input "regedit"</li>
<li>HKEY\_CURRENT\_USER/Software/GNU/Emacs/HOME=%The Home of Emacs%
(New a string value)</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">13.2.2</span> Swap the CapsLk &amp;&amp; Ctrl\_L</h4>
<div class="outline-text-4" id="text-13-2-2">
<ol class="org-ol">
<li><p>
Modify the regedit
</p>
<pre class="example">
  REGEDIT4

[HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Keyboard Layout]
"Scancode Map"=hex:00,00,00,00,00,00,00,00,
         03,00,00,00,1d,00,3a,00,
         3a,00,1d,00,00,00,00,00
  (New a binary Values)
</pre></li>
<li>Download Software:</li>
</ol>
<ul class="org-ul">
<li>The script: <a href="http://www.cs.umb.edu/~wimiller/stuff/caps2ctrl.exe">http://www.cs.umb.edu/~wimiller/stuff/caps2ctrl.exe</a></li>
<li>The source: <a href="http://www.cs.umb.edu/~wimiller/stuff/caps2ctrl.ahk">http://www.cs.umb.edu/~wimiller/stuff/caps2ctrl.ahk</a>
<ol class="org-ol">
<li><p>
AutoHotKey:
</p>
<pre class="example">
Capslock::Ctrl
</pre></li>
<li><b>Reference:</b>
<ul class="org-ul">
<li><a href="http://www.emacswiki.org/emacs/MovingTheCtrlKey">http://www.emacswiki.org/emacs/MovingTheCtrlKey</a></li>
</ul></li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">13.2.3</span> Reference:</h4>
<div class="outline-text-4" id="text-13-2-3">
<ul class="org-ul">
<li><a href="http://www.emacswiki.org/emacs/JonathanArnoldDotEmacs">http://www.emacswiki.org/emacs/JonathanArnoldDotEmacs</a></li>
</ul>
</div>
</div>
</div>
