_content/articles/Install-Something.org
*** Download:
    [[http://rubyinstaller.org/downloads/][RubyInstaller && DEVELOPMENT KIT]]
*** Install:
    Next -> Next -> ... -> Finish

    *Attention:*
    The path of the installer cannot have space!!!
*** Run:
    #+BEGIN_SRC sh
      > jekyll serve
    #+END_SRC
*** Change:
    http://ruby.taobao.org/
*** Q&A:
		1. Liquid Exception: incompatible character encodings: IBM437 and UTF-8
		   #+BEGIN_SRC sh
         # windows:
         > chcp 65001

         # Linux
         $ export LC_ALL=en_US.UTF-8
         $ export LANG=en_US.UTF-8
         $ jekyll --server --auto

		   #+END_SRC
		   Reference:
			 + http://chxt6896.github.io/blog/2012/02/13/blog-jekyll-native.html

		2. Python Django:
		   {&#37; autoescape off &#37;}
                Hello {&#123; name &#123;}
                {&#37; endautoescape &#37;}
		Reference:
			 + http://www.ascii.cl/htmlcodes.htm
** Install Foobar and config her
** Install Win7Code
** Install mit-scheme and fix some issue
** Install Java Development

** Install Qt Development
*** Download:
		1. Download Address:  http://qt-project.org/downloads
		2. 我下载的是：[[http://mirrors.ustc.edu.cn/qtproject/official_releases/qt/4.8/4.8.4/qt-win-opensource-4.8.4-vs2010.exe][Qt libraries 4.8.4 for Windows (VS 2010, 234 MB) (Info)]]
*** Install:
		1. Next->Next->...->Finish
*** Configure:
		1. use it in terminal (vs2010):
		   Please use the : Qt 4.8.4 Command Prompt
*** Emacs:
		+ http://www.emacswiki.org/emacs/QtMode
		+ http://www.emacswiki.org/emacs/CcMode
		+ http://alexott.blogspot.it/2009/02/cedet-qt.html
*** Q && A:
		1. Makefile.Debug:59: *** missing separator.  Stop.:
		   #+BEGIN_SRC sh
         # Qt 4.8.4 Command Prompt
         > qmake -project
         > qmake
         > nmake
		   #+END_SRC
		   Reference:
			 + http://stackoverflow.com/questions/12339099/what-does-the-missing-separator-make-error-mean-when-using-qt/16714236#16714236
			 + http://www.verydemo.com/demo_c92_i131633.html
			 + http://www.qtforum.org/article/23450/qt4-and-mysql-driver-problem.html
			 + http://superuser.com/questions/375029/make-interrupt-exception-caught

* Linux
** Install Emacs and config it
   1. Go to [[http://ftp.gnu.org/gnu/emacs/][here(main GNU ftp)]] to download the lastest .xz
   2. Install the depends below:
      #+BEGIN_SRC sh
        $ sudo apt-get install texinfo build-essential
        $ sudo aptitude install libdbus-1-dev libgconf2-dev libgif-dev libgpm-dev \
          libgtk2.0-dev libjpeg62-dev libm17n-dev libncurses5-dev \
          libotf-dev librsvg2-dev libtiff4-dev libXpm-dev

        $ ./configure
        $ make bootstrap
        $ make
        $ src/emacs -q ;; This checks that it built properly
        $ sudo make install
        $ mv /usr/local/bin/emacs-24.0.50 /usr/local/bin/emacs24
        ;; Change the number to whatever the version is, I moved it to a more convienent name
        $ emacs24 -q
      #+END_SRC
   3. Download this config files!
** Install Google Chrome
   1. Go to [[https://www.google.com/intl/en/chrome/browser/][here]] to download the leaset google-chrome
   2. Who can tell me why hwo to solve it:
      =Dependency is not satisfiable: libudev0(>=147)=
      (I was in Ubuntu13.04 amd64)
** Return to classic gnome for ubuntu12.04+
   #+BEGIN_SRC sh
     $ sudo apt-get install gnome-session-fallback
   #+END_SRC
** Install Git (You can find the books. Just click [[https://github.s3.amazonaws.com/media/progit.en.pdf][here]])
   1. Go to [[https://github.com/git/git][here]] download the lastest git.
   2. Follow the [[http://git-scm.com/book/en/Getting-Started-Installing-Git][1.4 Getting Started - Installing Git]].
      The main steps are:
      #+BEGIN_SRC sh
        $ apt-get install libcurl4-gnutls-dev libexpat1-dev gettext \
          libz-dev libssl-dev
        $ tar -zxf git-1.7.2.2.tar.gz
        $ cd git-1.7.2.2
        $ make prefix=/usr/local all
        $ sudo make prefix=/usr/local install
        # Below is options:
        $ git clone git://git.kernel.org/pub/scm/git/git.git
      #+END_SRC
   3. Follow the [[http://git-scm.com/book/en/Getting-Started-First-Time-Git-Setup][1.5 Getting Started - First-Time Git Setup]].
      The main steps are:
      #+BEGIN_SRC sh
        $ git config --global user.name "John Doe"
        $ git config --global user.email johndoe@example.com
      #+END_SRC
   4. Now, you can [[https://help.github.com/articles/generating-ssh-keys][Generating SSH Keys]].
      The main steps are:
      #+BEGIN_SRC sh
        $ ssh-keygen -t rsa -C "your_email@example.com"
        $ sudo apt-get install xclip
        $ xclip -sel clip < ~/.ssh/id_rsa.pub
      #+END_SRC
