static/html/articles/Install-Something.html
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">13.3</span> Install Jekyll</h3>
<div class="outline-text-3" id="text-13-3">
</div><div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">13.3.1</span> Download:</h4>
<div class="outline-text-4" id="text-13-3-1">
<p>
<a href="http://rubyinstaller.org/downloads/">RubyInstaller &amp;&amp; DEVELOPMENT KIT</a>
</p>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">13.3.2</span> Install:</h4>
<div class="outline-text-4" id="text-13-3-2">
<p>
Next -&gt; Next -&gt; &#x2026; -&gt; Finish
</p>

<p>
<b>Attention:</b>
The path of the installer cannot have space!!!
</p>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28"><span class="section-number-4">13.3.3</span> Run:</h4>
<div class="outline-text-4" id="text-13-3-3">
<div class="org-src-container">

<pre class="src src-sh">&gt; jekyll serve
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">13.3.4</span> Change:</h4>
<div class="outline-text-4" id="text-13-3-4">
<p>
<a href="http://ruby.taobao.org/">http://ruby.taobao.org/</a>
</p>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="section-number-4">13.3.5</span> Q&amp;A:</h4>
<div class="outline-text-4" id="text-13-3-5">
<ol class="org-ol">
<li><p>
Liquid Exception: incompatible character encodings: IBM437 and UTF-8
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">windows:</span>
&gt; chcp 65001

<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">Linux</span>
$ export <span style="color: #f0c674;">LC_ALL</span>=en_US.UTF-8
$ export <span style="color: #f0c674;">LANG</span>=en_US.UTF-8
$ jekyll --server --auto
</pre>
</div>
<p>
Reference:
</p>
<ul class="org-ul">
<li><a href="http://chxt6896.github.io/blog/2012/02/13/blog-jekyll-native.html">http://chxt6896.github.io/blog/2012/02/13/blog-jekyll-native.html</a></li>
</ul></li>

<li>Python Django:
{&amp;#37; autoescape off &amp;#37;}</li>
</ol>
<p>
Hello {&amp;#123; name &amp;#123;}
{&amp;#37; endautoescape &amp;#37;}
Reference:
</p>
<ul class="org-ul">
<li><a href="http://www.ascii.cl/htmlcodes.htm">http://www.ascii.cl/htmlcodes.htm</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">13.4</span> Install Foobar and config her</h3>
</div>
<div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">13.5</span> Install Win7Code</h3>
</div>
<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34"><span class="section-number-3">13.6</span> Install mit-scheme and fix some issue</h3>
</div>
<div id="outline-container-orgheadline35" class="outline-3">
<h3 id="orgheadline35"><span class="section-number-3">13.7</span> Install Java Development</h3>
</div>

<div id="outline-container-orgheadline41" class="outline-3">
<h3 id="orgheadline41"><span class="section-number-3">13.8</span> Install Qt Development</h3>
<div class="outline-text-3" id="text-13-8">
</div><div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36"><span class="section-number-4">13.8.1</span> Download:</h4>
<div class="outline-text-4" id="text-13-8-1">
<ol class="org-ol">
<li>Download Address:  <a href="http://qt-project.org/downloads">http://qt-project.org/downloads</a></li>
<li>我下载的是：<a href="http://mirrors.ustc.edu.cn/qtproject/official_releases/qt/4.8/4.8.4/qt-win-opensource-4.8.4-vs2010.exe">Qt libraries 4.8.4 for Windows (VS 2010, 234 MB) (Info)</a></li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline37" class="outline-4">
<h4 id="orgheadline37"><span class="section-number-4">13.8.2</span> Install:</h4>
<div class="outline-text-4" id="text-13-8-2">
<ol class="org-ol">
<li>Next-&gt;Next-&gt;&#x2026;-&gt;Finish</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline38" class="outline-4">
<h4 id="orgheadline38"><span class="section-number-4">13.8.3</span> Configure:</h4>
<div class="outline-text-4" id="text-13-8-3">
<ol class="org-ol">
<li>use it in terminal (vs2010):
Please use the : Qt 4.8.4 Command Prompt</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39"><span class="section-number-4">13.8.4</span> Emacs:</h4>
<div class="outline-text-4" id="text-13-8-4">
<ul class="org-ul">
<li><a href="http://www.emacswiki.org/emacs/QtMode">http://www.emacswiki.org/emacs/QtMode</a></li>
<li><a href="http://www.emacswiki.org/emacs/CcMode">http://www.emacswiki.org/emacs/CcMode</a></li>
<li><a href="http://alexott.blogspot.it/2009/02/cedet-qt.html">http://alexott.blogspot.it/2009/02/cedet-qt.html</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline40" class="outline-4">
<h4 id="orgheadline40"><span class="section-number-4">13.8.5</span> Q &amp;&amp; A:</h4>
<div class="outline-text-4" id="text-13-8-5">
<ol class="org-ol">
<li><p>
Makefile.Debug:59: <b>*</b> missing separator.  Stop.:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">Qt 4.8.4 Command Prompt</span>
&gt; qmake -project
&gt; qmake
&gt; nmake
</pre>
</div>
<p>
Reference:
</p>
<ul class="org-ul">
<li><a href="http://stackoverflow.com/questions/12339099/what-does-the-missing-separator-make-error-mean-when-using-qt/16714236#16714236">http://stackoverflow.com/questions/12339099/what-does-the-missing-separator-make-error-mean-when-using-qt/16714236#16714236</a></li>
<li><a href="http://www.verydemo.com/demo_c92_i131633.html">http://www.verydemo.com/demo_c92_i131633.html</a></li>
<li><a href="http://www.qtforum.org/article/23450/qt4-and-mysql-driver-problem.html">http://www.qtforum.org/article/23450/qt4-and-mysql-driver-problem.html</a></li>
<li><a href="http://superuser.com/questions/375029/make-interrupt-exception-caught">http://superuser.com/questions/375029/make-interrupt-exception-caught</a></li>
</ul></li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline57" class="outline-2">
<h2 id="orgheadline57"><span class="section-number-2">14</span> Linux</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-orgheadline43" class="outline-3">
<h3 id="orgheadline43"><span class="section-number-3">14.1</span> Install Emacs and config it</h3>
<div class="outline-text-3" id="text-14-1">
<ol class="org-ol">
<li>Go to <a href="http://ftp.gnu.org/gnu/emacs/">here(main GNU ftp)</a> to download the lastest .xz</li>
<li><p>
Install the depends below:
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo apt-get install texinfo build-essential
$ sudo aptitude install libdbus-1-dev libgconf2-dev libgif-dev libgpm-dev <span style="color: #8abeb7;">\</span>
  libgtk2.0-dev libjpeg62-dev libm17n-dev libncurses5-dev <span style="color: #8abeb7;">\</span>
  libotf-dev librsvg2-dev libtiff4-dev libXpm-dev

$ ./configure
$ make bootstrap
$ make
$ src/emacs -q ;; This checks that it built properly
$ sudo make install
$ mv /usr/local/bin/emacs-24.0.50 /usr/local/bin/emacs24
;; Change the number to whatever the version is, I moved it to a more convienent name
$ emacs24 -q
</pre>
</div></li>
<li>Download this config files!</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline44" class="outline-3">
<h3 id="orgheadline44"><span class="section-number-3">14.2</span> Install Google Chrome</h3>
<div class="outline-text-3" id="text-14-2">
<ol class="org-ol">
<li>Go to <a href="https://www.google.com/intl/en/chrome/browser/">here</a> to download the leaset google-chrome</li>
<li>Who can tell me why hwo to solve it:
<code>Dependency is not satisfiable: libudev0(&gt;=147)</code>
(I was in Ubuntu13.04 amd64)</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline45" class="outline-3">
<h3 id="orgheadline45"><span class="section-number-3">14.3</span> Return to classic gnome for ubuntu12.04+</h3>
<div class="outline-text-3" id="text-14-3">
<div class="org-src-container">

<pre class="src src-sh">$ sudo apt-get install gnome-session-fallback
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline46" class="outline-3">
<h3 id="orgheadline46"><span class="section-number-3">14.4</span> Install Git (You can find the books. Just click <a href="https://github.s3.amazonaws.com/media/progit.en.pdf">here</a>)</h3>
<div class="outline-text-3" id="text-14-4">
<ol class="org-ol">
<li>Go to <a href="https://github.com/git/git">here</a> download the lastest git.</li>
<li><p>
Follow the <a href="http://git-scm.com/book/en/Getting-Started-Installing-Git">1.4 Getting Started - Installing Git</a>.
The main steps are:
</p>
<div class="org-src-container">

<pre class="src src-sh">$ apt-get install libcurl4-gnutls-dev libexpat1-dev gettext <span style="color: #8abeb7;">\</span>
  libz-dev libssl-dev
$ tar -zxf git-1.7.2.2.tar.gz
$ cd git-1.7.2.2
$ make <span style="color: #f0c674;">prefix</span>=/usr/local all
$ sudo make <span style="color: #f0c674;">prefix</span>=/usr/local install
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">Below is options:</span>
$ git clone git://git.kernel.org/pub/scm/git/git.git
</pre>
</div></li>
<li><p>
Follow the <a href="http://git-scm.com/book/en/Getting-Started-First-Time-Git-Setup">1.5 Getting Started - First-Time Git Setup</a>.
The main steps are:
</p>
<div class="org-src-container">

<pre class="src src-sh">$ git config --global user.name <span style="color: #8abeb7;">"John Doe"</span>
$ git config --global user.email johndoe@example.com
</pre>
</div></li>
<li><p>
Now, you can <a href="https://help.github.com/articles/generating-ssh-keys">Generating SSH Keys</a>.
The main steps are:
</p>
<div class="org-src-container">

<pre class="src src-sh">$ ssh-keygen -t rsa -C <span style="color: #8abeb7;">"your_email@example.com"</span>
$ sudo apt-get install xclip
$ xclip -sel clip &lt; ~/.ssh/id_rsa.pub
</pre>
</div></li>
</ol>
</div>
</div>
