_content/articles/Install-Something.org
** Add the picture when ubuntu boot up
   *Please pay more attenttion to modify this file*
   1. Move the picture to the =/usr/share/backgrounds=
   2. Replace:
      #+BEGIN_SRC sh
        ### BEGIN /etc/grub.d/05_debian_theme ###
        set menu_color_normal=white/black
        set menu_color_highlight=black/light-gray
        if background_color 44,0,30; then
          clear
        fi
        ### END /etc/grub.d/05_debian_theme ###
      #+END_SRC

      With:
      #+BEGIN_SRC sh
        ### BEGIN /etc/grub.d/05_debian_theme ###
        insmod part_msdos
        insmod ext4
        # Here you should use (sudo fdisk -l) to see /dev/sda??
        set root='(hd0,msdos10)'
        search --no-floppy --fs-uuid --set e3a8ca35-417d-4da2-9380-91f08a9e4fb2
        insmod png
        if background_image /usr/share/backgrounds/spacefun-grub-widescreen.png;
        then
          set color_normal=light-gray/black
          set color_highlight=white/black
        else
          set menu_color_normal=cyan/blue
          set menu_color_highlight=white/blue
        fi
        ### END /etc/grub.d/05_debian_theme ###
      #+END_SRC
   3. Reboot
** Install Adobe Flash Player
   1. Go to [[http://get.adobe.com/flashplayer/?no_redirect][here]] to download it.
   2. Extract it.
   3. Follow below:
      #+BEGIN_SRC sh
        # Make sure libflashplayer.so with +x
        $ sudo cp libflashplayer.so /usr/lib/firefox/plugins/
        $ sudo cp -r usr/* /usr
      #+END_SRC
   4. Open your browser to test!
** Install Lua and Luarocks
*** lua
    1. Go to [[http://www.lua.org/download.html][here]] to download
    2. Extra it
    3. =make linux=
       (if error: no readline.h. =sudo apt-get install libreadline-dev=)
    4. =sudo make install=
    5. Over~
*** Luarocks
    1. Go to [[http://luarocks.org/releases/][here]] to doanload and the extra it
    2. =./configure=
    3. =make=
    4. =sudo make install=
    5. Over~
** Install Java
   1. Download the tar.gz package from official [[http://www.oracle.com/technetwork/java/javase/downloads/index.html][repo]]
   2. Unzipped
   3. Copy/Move the unzipped category to /usr/lib/jvm/
   4. Now Run
      #+BEGIN_SRC sh
        update-alternatives --install "/usr/bin/java" "java" "/usr/lib/jvm/jdk1.7.0/bin/java" 1
        sudo update-alternatives --install "/usr/bin/javac" "javac" "/usr/lib/jvm/jdk1.7.0/bin/javac" 1
        sudo update-alternatives --install "/usr/bin/javaws" "javaws" "/usr/lib/jvm/jdk1.7.0/bin/javaws" 1
      #+END_SRC
   5. Correct the file ownership and the permissions of the executables:(if necessary)
      #+BEGIN_SRC sh
        sudo chmod a+x /usr/bin/java
        sudo chmod a+x /usr/bin/javac
        sudo chmod a+x /usr/bin/javaws
        sudo chown -R root:root /usr/lib/jvm/jdk1.7.0
      #+END_SRC
   6. Test
      #+BEGIN_SRC sh
        java -version
      #+END_SRC
   *Reference:*
   + http://au9ustine.bitbucket.org/blogs/2012-06-08.html
   + http://askubuntu.com/questions/55848/how-do-i-install-oracle-java-jdk-7
** MySQL
   #+BEGIN_SRC sh
     # start on runlevel [2345]
     stop on starting rc RUNLEVEL=[016]
   #+END_SRC
** Change Some Key Shortcuts
   1. Launchers > Key to show the HUD
      =Alt+Alt R=

   2. Windows > Activate the window menu
      =Menu=

   3. Alt + key to active menu
      Alt+E > Keyboard Shortcuts

** Make Ubuntu12.04 hibernation
   1. open file
      #+BEGIN_SRC sh
        sudo vi /etc/polkit-1/localauthority/50-local.d/com.ubuntu.enable-hibernate.pkla
      #+END_SRC
   2. modify
      #+BEGIN_SRC sh
        [Re-enable hibernate by default]
        Identity=unix-user:*
        Action=org.freedesktop.upower.hibernate
        ResultActive=yes
      #+END_SRC
   3. reboot

   *Reference:*
   + http://askubuntu.com/questions/94754/how-to-enable-hibernation
** Install Ubuntu12.04 black screen
   安装ubuntu12.04花屏。
   #+BEGIN_EXAMPLE
   在开机时进入grub编辑程序，在quite splash后面加上nomodeset
   #+END_EXAMPLE
   *Reference:*
   1. http://ycool.com/post/brncevj
   2. http://wiki.ubuntu-tw.org/index.php?title=FAQinstall
