static/html/articles/Install-Something.html
<div id="outline-container-orgheadline47" class="outline-3">
<h3 id="orgheadline47"><span class="section-number-3">14.5</span> Add the picture when ubuntu boot up</h3>
<div class="outline-text-3" id="text-14-5">
<p>
<b>Please pay more attenttion to modify this file</b>
</p>
<ol class="org-ol">
<li>Move the picture to the <code>/usr/share/backgrounds</code></li>
<li><p>
Replace:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #969896; font-style: italic;">### </span><span style="color: #969896; font-style: italic;">BEGIN /etc/grub.d/05_debian_theme ###</span>
<span style="color: #b294bb;">set</span> <span style="color: #f0c674;">menu_color_normal</span>=white/black
<span style="color: #b294bb;">set</span> <span style="color: #f0c674;">menu_color_highlight</span>=black/light-gray
<span style="color: #b5bd68;">if</span> background_color 44,0,30; <span style="color: #b5bd68;">then</span>
  clear
<span style="color: #b5bd68;">fi</span>
<span style="color: #969896; font-style: italic;">### </span><span style="color: #969896; font-style: italic;">END /etc/grub.d/05_debian_theme ###</span>
</pre>
</div>

<p>
With:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #969896; font-style: italic;">### </span><span style="color: #969896; font-style: italic;">BEGIN /etc/grub.d/05_debian_theme ###</span>
insmod part_msdos
insmod ext4
<span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">Here you should use (sudo fdisk -l) to see /dev/sda??</span>
<span style="color: #b294bb;">set</span> <span style="color: #f0c674;">root</span>=<span style="color: #8abeb7;">'(hd0,msdos10)'</span>
search --no-floppy --fs-uuid --set e3a8ca35-417d-4da2-9380-91f08a9e4fb2
insmod png
<span style="color: #b5bd68;">if</span> background_image /usr/share/backgrounds/spacefun-grub-widescreen.png;
<span style="color: #b5bd68;">then</span>
  <span style="color: #b294bb;">set</span> <span style="color: #f0c674;">color_normal</span>=light-gray/black
  <span style="color: #b294bb;">set</span> <span style="color: #f0c674;">color_highlight</span>=white/black
<span style="color: #b5bd68;">else</span>
  <span style="color: #b294bb;">set</span> <span style="color: #f0c674;">menu_color_normal</span>=cyan/blue
  <span style="color: #b294bb;">set</span> <span style="color: #f0c674;">menu_color_highlight</span>=white/blue
<span style="color: #b5bd68;">fi</span>
<span style="color: #969896; font-style: italic;">### </span><span style="color: #969896; font-style: italic;">END /etc/grub.d/05_debian_theme ###</span>
</pre>
</div></li>
<li>Reboot</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline48" class="outline-3">
<h3 id="orgheadline48"><span class="section-number-3">14.6</span> Install Adobe Flash Player</h3>
<div class="outline-text-3" id="text-14-6">
<ol class="org-ol">
<li>Go to <a href="http://get.adobe.com/flashplayer/?no_redirect">here</a> to download it.</li>
<li>Extract it.</li>
<li><p>
Follow below:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">Make sure libflashplayer.so with +x</span>
$ sudo cp libflashplayer.so /usr/lib/firefox/plugins/
$ sudo cp -r usr/* /usr
</pre>
</div></li>
<li>Open your browser to test!</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline51" class="outline-3">
<h3 id="orgheadline51"><span class="section-number-3">14.7</span> Install Lua and Luarocks</h3>
<div class="outline-text-3" id="text-14-7">
</div><div id="outline-container-orgheadline49" class="outline-4">
<h4 id="orgheadline49"><span class="section-number-4">14.7.1</span> lua</h4>
<div class="outline-text-4" id="text-14-7-1">
<ol class="org-ol">
<li>Go to <a href="http://www.lua.org/download.html">here</a> to download</li>
<li>Extra it</li>
<li><code>make linux</code>
       (if error: no readline.h. <code>sudo apt-get install libreadline-dev</code>)</li>
<li><code>sudo make install</code></li>
<li>Over~</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline50" class="outline-4">
<h4 id="orgheadline50"><span class="section-number-4">14.7.2</span> Luarocks</h4>
<div class="outline-text-4" id="text-14-7-2">
<ol class="org-ol">
<li>Go to <a href="http://luarocks.org/releases/">here</a> to doanload and the extra it</li>
<li><code>./configure</code></li>
<li><code>make</code></li>
<li><code>sudo make install</code></li>
<li>Over~</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgheadline52" class="outline-3">
<h3 id="orgheadline52"><span class="section-number-3">14.8</span> Install Java</h3>
<div class="outline-text-3" id="text-14-8">
<ol class="org-ol">
<li>Download the tar.gz package from official <a href="http://www.oracle.com/technetwork/java/javase/downloads/index.html">repo</a></li>
<li>Unzipped</li>
<li>Copy/Move the unzipped category to <i>usr/lib/jvm</i></li>
<li><p>
Now Run
</p>
<div class="org-src-container">

<pre class="src src-sh">update-alternatives --install <span style="color: #8abeb7;">"/usr/bin/java"</span> <span style="color: #8abeb7;">"java"</span> <span style="color: #8abeb7;">"/usr/lib/jvm/jdk1.7.0/bin/java"</span> 1
sudo update-alternatives --install <span style="color: #8abeb7;">"/usr/bin/javac"</span> <span style="color: #8abeb7;">"javac"</span> <span style="color: #8abeb7;">"/usr/lib/jvm/jdk1.7.0/bin/javac"</span> 1
sudo update-alternatives --install <span style="color: #8abeb7;">"/usr/bin/javaws"</span> <span style="color: #8abeb7;">"javaws"</span> <span style="color: #8abeb7;">"/usr/lib/jvm/jdk1.7.0/bin/javaws"</span> 1
</pre>
</div></li>
<li><p>
Correct the file ownership and the permissions of the executables:(if necessary)
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo chmod a+x /usr/bin/java
sudo chmod a+x /usr/bin/javac
sudo chmod a+x /usr/bin/javaws
sudo chown -R root:root /usr/lib/jvm/jdk1.7.0
</pre>
</div></li>
<li><p>
Test
</p>
<div class="org-src-container">

<pre class="src src-sh">java -version
</pre>
</div></li>
</ol>
<p>
<b>Reference:</b>
</p>
<ul class="org-ul">
<li><a href="http://au9ustine.bitbucket.org/blogs/2012-06-08.html">http://au9ustine.bitbucket.org/blogs/2012-06-08.html</a></li>
<li><a href="http://askubuntu.com/questions/55848/how-do-i-install-oracle-java-jdk-7">http://askubuntu.com/questions/55848/how-do-i-install-oracle-java-jdk-7</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline53" class="outline-3">
<h3 id="orgheadline53"><span class="section-number-3">14.9</span> MySQL</h3>
<div class="outline-text-3" id="text-14-9">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">start on runlevel [2345]</span>
stop on starting rc <span style="color: #f0c674;">RUNLEVEL</span>=<span style="color: #c5c8c6;">[</span>016<span style="color: #c5c8c6;">]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline54" class="outline-3">
<h3 id="orgheadline54"><span class="section-number-3">14.10</span> Change Some Key Shortcuts</h3>
<div class="outline-text-3" id="text-14-10">
<ol class="org-ol">
<li>Launchers &gt; Key to show the HUD
<code>Alt+Alt R</code></li>

<li>Windows &gt; Activate the window menu
<code>Menu</code></li>

<li>Alt + key to active menu
Alt+E &gt; Keyboard Shortcuts</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline55" class="outline-3">
<h3 id="orgheadline55"><span class="section-number-3">14.11</span> Make Ubuntu12.04 hibernation</h3>
<div class="outline-text-3" id="text-14-11">
<ol class="org-ol">
<li><p>
open file
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo vi /etc/polkit-1/localauthority/50-local.d/com.ubuntu.enable-hibernate.pkla
</pre>
</div></li>
<li><p>
modify
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #c5c8c6;">[</span>Re-enable hibernate by default<span style="color: #c5c8c6;">]</span>
<span style="color: #f0c674;">Identity</span>=unix-user:*
<span style="color: #f0c674;">Action</span>=org.freedesktop.upower.hibernate
<span style="color: #f0c674;">ResultActive</span>=yes
</pre>
</div></li>
<li>reboot</li>
</ol>

<p>
<b>Reference:</b>
</p>
<ul class="org-ul">
<li><a href="http://askubuntu.com/questions/94754/how-to-enable-hibernation">http://askubuntu.com/questions/94754/how-to-enable-hibernation</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline56" class="outline-3">
<h3 id="orgheadline56"><span class="section-number-3">14.12</span> Install Ubuntu12.04 black screen</h3>
<div class="outline-text-3" id="text-14-12">
<p>
安装ubuntu12.04花屏。
</p>
<pre class="example">
在开机时进入grub编辑程序，在quite splash后面加上nomodeset
</pre>
<p>
<b>Reference:</b>
</p>
<ol class="org-ol">
<li><a href="http://ycool.com/post/brncevj">http://ycool.com/post/brncevj</a></li>
<li><a href="http://wiki.ubuntu-tw.org/index.php?title=FAQinstall">http://wiki.ubuntu-tw.org/index.php?title=FAQinstall</a></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="meta-article"><p class="author">Junjia Ni</p>
<p class="email"><a href="mailto:creamidea@gmail.com">creamidea@gmail.com</a></p>
<p class="date">2015-12-27</p>
<p class="export-date">2016-10-09 Sun 22:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.3.6)</p>
<p class="validation"></p>
<p class="last-modification-time">2016-05-08 Sun 18:38</p></div><script asyn src="/static/article.js"></script><!-- Google Analytics --><script>window.ga=window.ga||function(){(ga.q=ga.q||[]).push(arguments)};ga.l=+new Date;ga('create', 'UA-38213594-1', 'auto');ga('send', 'pageview');</script><script async src='//www.google-analytics.com/analytics.js'></script><!-- End Google Analytics -->
</div>
</body>
</html>
